1. Haz las importaciones necesarias para establecer la conexión y trabajar con Pandas. Establece la conexión usando mysql.connector utilizando try/except por si la conexión devielve un error.

In [8]:
import mysql.connector

import pandas as pd

try:
    cnx = mysql.connector.connect(
        user="root",
        password="AlumnaAdalab",
        host="127.0.0.1",
        auth_plugin='mysql_native_password'
    )
    print(cnx.is_connected())
except:
    print("No se ha podido establecer la conexión")

True

2. Crea un nuevo "schema" llamado "alumnas-promo-X"

In [9]:
cnx = mysql.connector.connect(
    user="root",
    password="AlumnaAdalab",
    host="127.0.0.1",
    auth_plugin='mysql_native_password')

mycursor = cnx.cursor()

query = ("CREATE SCHEMA alumnas_promo_B_NICOLE_LEYRE")

mycursor.execute(query)

print(mycursor)

MySQLCursor: CREATE SCHEMA alumnas_promo_B_NICOLE_LEY..

3. Crea una tabla con la información de las alumnas de la promo. Debe incluir: id_alumna, nombre, apellidos, ciudad y teléfono.

In [10]:
cnx = mysql.connector.connect(
    user="root",
    password="AlumnaAdalab",
    host="127.0.0.1",
    database="alumnas_promo_B_NICOLE_LEYRE",
    auth_plugin='mysql_native_password')

mycursor = cnx.cursor()

query = ("CREATE TABLE alumnas (id_alumna INT AUTO_INCREMENT NOT NULL, nombre VARCHAR(20), apellidos VARCHAR(30), ciudad VARCHAR (20), telefono INT, PRIMARY KEY (id_alumna))")

mycursor.execute(query)

print(mycursor)

MySQLCursor: CREATE TABLE alumnas (id_alumna INT AUTO..

4. Inserta por lo menos 10 datos en la tabla creada en el ejercicio anterior (pueden ser inventados).

In [11]:

sql = ("INSERT INTO alumnas (nombre, apellidos, ciudad, telefono) VALUES (%s,%s,%s,%s)")

val = [("Leyre", "López de Silanes", "Madrid", 641587458), ("Nicole", "Aliaga", "La Paz", 645748957), ("Roberta", "Costa", "Barcelona", 625987458), ("Ana", "Torres", "Valencia", 652369857), ("Michaela", "Silva", "Madrid", 635897587), ("Fabiana", "Badani", "La Paz", 698574874), ("Andrés", "Torres", "Ibiza", 635214785), ("Iván", "Martinez", "Vigo", 658748547), ("Guillermo", "Rodríguez", "Santander", 622547584), ("Álvaro", "Nebreda", "Burgos", 635214758)]

mycursor.executemany(sql, val)

cnx.commit()

print(mycursor)

MySQLCursor: INSERT INTO alumnas (nombre, apellidos, ..

5. Haz una consulta que devuelva todos los registros de la tabla "alumnas" y conviértelo en Dataframe (no te olvides del nombre de las columnas).

In [13]:
query = "SELECT * FROM alumnas"

mycursor.execute(query)

myresults = mycursor.fetchall()

df = pd.DataFrame(myresults, columns = ["id_alumna", "nombre", "apellido", "ciudad", "telefono"])

print(df)

   id_alumna     nombre          apellido     ciudad   telefono
0          1      Leyre  López de Silanes     Madrid  641587458
1          2     Nicole            Aliaga     La Paz  645748957
2          3    Roberta             Costa  Barcelona  625987458
3          4        Ana            Torres   Valencia  652369857
4          5   Michaela             Silva     Madrid  635897587
5          6    Fabiana            Badani     La Paz  698574874
6          7     Andrés            Torres      Ibiza  635214785
7          8       Iván          Martinez       Vigo  658748547
8          9  Guillermo         Rodríguez  Santander  622547584
9         10     Álvaro           Nebreda     Burgos  635214758

6. Muestra los 3 primeros y tres últimos registros del Dataframe.

In [15]:
print(df.head(3))

print(df.tail(3))

   id_alumna   nombre          apellido     ciudad   telefono
0          1    Leyre  López de Silanes     Madrid  641587458
1          2   Nicole            Aliaga     La Paz  645748957
2          3  Roberta             Costa  Barcelona  625987458
   id_alumna     nombre   apellido     ciudad   telefono
7          8       Iván   Martinez       Vigo  658748547
8          9  Guillermo  Rodríguez  Santander  622547584
9         10     Álvaro    Nebreda     Burgos  635214758

7. ¿Hay registros duplicados?

In [16]:
df.duplicated()

0    False
1    False
2    False
3    False
4    False
5    False
6    False
7    False
8    False
9    False
dtype: bool

8. Haz una consulta para extraer las diferentes ciudades en las que hay alumnas.

In [22]:
cnx = mysql.connector.connect(
    user="root",
    password="AlumnaAdalab",
    host="127.0.0.1",
    database="alumnas_promo_B_NICOLE_LEYRE",
    auth_plugin='mysql_native_password')

query = ("SELECT ciudad FROM alumnas")

df1 = pd.read_sql_query(query, cnx)

df1

C:\Users\leyre\AppData\Local\Temp\ipykernel_31432\3835552155.py:10: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df1 = pd.read_sql_query(query, cnx)

      ciudad
0     Madrid
1     La Paz
2  Barcelona
3   Valencia
4     Madrid
5     La Paz
6      Ibiza
7       Vigo
8  Santander
9     Burgos

9. Crea al menos dos Dataframes con la información de las alumnas de dos ciudades diferentes (usando dos queries).

In [24]:
cnx = mysql.connector.connect(
    user="root",
    password="AlumnaAdalab",
    host="127.0.0.1",
    database="alumnas_promo_B_NICOLE_LEYRE",
    auth_plugin='mysql_native_password')

query1 = ("SELECT * FROM alumnas WHERE ciudad = 'La Paz'")

query2 = ("SELECT * FROM alumnas WHERE ciudad = 'Madrid'")

df1 = pd.read_sql_query(query1, cnx)

df2 = pd.read_sql_query(query2, cnx)

print(df1)

print(df2)

   id_alumna   nombre apellidos  ciudad   telefono
0          2   Nicole    Aliaga  La Paz  645748957
1          6  Fabiana    Badani  La Paz  698574874
   id_alumna    nombre         apellidos  ciudad   telefono
0          1     Leyre  López de Silanes  Madrid  641587458
1          5  Michaela             Silva  Madrid  635897587

C:\Users\leyre\AppData\Local\Temp\ipykernel_31432\2608771874.py:12: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df1 = pd.read_sql_query(query1, cnx)
C:\Users\leyre\AppData\Local\Temp\ipykernel_31432\2608771874.py:14: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df2 = pd.read_sql_query(query2, cnx)